app/controllers/seekers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "updated_at" = '2011-10-06 21:59:27.686043', "first_name" = 'Chadwick' WHERE "users"."id" = 1