app/controllers/biddings_controller.rb

  def index
    @biddings = Bidding.all
---
SELECT "biddings".* FROM "biddings"