app/controllers/users_controller.rb

INSERT INTO "users" ("remember_me_token", "role_id", "seeking", "email", "crypted_password", "last_name", "created_at", "remember_me_token_expires_at", "updated_at", "salt", "first_name", "user_url") VALUES (NULL, 3, 'a jerb', 'chad.mckenna@gmail.com', '$2a$10$oaZEf1o6l8Z3c46iRMQ/h.V7XGxC6Fa2pagsY/dT69cuYpZusrMHW', 'McKenna', '2011-10-07 01:54:01.987660', NULL, '2011-10-07 01:54:01.987660', 'a5c6a551f63ec8af5110b7fe0b6fb6803b01b728', 'Chad', 'chad.mckenna')
---
  def create
    @user = User.new(params[:user])

    if @user.valid?
      # Run validations before the user is saved. This allows the render 'new' to work as well as adds 'fields with errors' divs to the form
      @user = Employer.new(params[:user]) if params[:role].eql? 'employer'
      @user = JobSeeker.new(params[:user]) if params[:role].eql? 'job_seeker'
      @user.save